tests/fileio/output/2020-12-22T05:09:53+0200-vm-fileio.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3191.13
    fsyncs/s:                     4088.40

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               49.86

General statistics:
    total time:                          30.0155s
    total number of events:              218409

Latency (ms):
         min:                                    0.02
         avg:                                    0.14
         max:                                   20.29
         95th percentile:                        0.15
         sum:                                29767.74

Threads fairness:
    events (avg/stddev):           218409.0000/0.00
    execution time (avg/stddev):   29.7677/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3229.89
    fsyncs/s:                     4137.42

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.47

General statistics:
    total time:                          30.0281s
    total number of events:              221127

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   19.36
         95th percentile:                        0.16
         sum:                                29779.33

Threads fairness:
    events (avg/stddev):           221127.0000/0.00
    execution time (avg/stddev):   29.7793/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3270.29
    fsyncs/s:                     4189.17

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               51.10

General statistics:
    total time:                          30.0240s
    total number of events:              223864

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   20.91
         95th percentile:                        0.15
         sum:                                29768.20

Threads fairness:
    events (avg/stddev):           223864.0000/0.00
    execution time (avg/stddev):   29.7682/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3244.65
    fsyncs/s:                     4156.75

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.70

General statistics:
    total time:                          30.0147s
    total number of events:              222052

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   19.75
         95th percentile:                        0.15
         sum:                                29766.35

Threads fairness:
    events (avg/stddev):           222052.0000/0.00
    execution time (avg/stddev):   29.7664/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3341.64
    fsyncs/s:                     4280.07

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               52.21

General statistics:
    total time:                          30.0218s
    total number of events:              228719

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   20.75
         95th percentile:                        0.13
         sum:                                29716.86

Threads fairness:
    events (avg/stddev):           228719.0000/0.00
    execution time (avg/stddev):   29.7169/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3232.90
    fsyncs/s:                     4141.08

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.51

General statistics:
    total time:                          30.0300s
    total number of events:              221349

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   17.97
         95th percentile:                        0.16
         sum:                                29778.15

Threads fairness:
    events (avg/stddev):           221349.0000/0.00
    execution time (avg/stddev):   29.7782/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3249.89
    fsyncs/s:                     4160.46

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.78

General statistics:
    total time:                          30.0279s
    total number of events:              222418

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   22.82
         95th percentile:                        0.15
         sum:                                29766.96

Threads fairness:
    events (avg/stddev):           222418.0000/0.00
    execution time (avg/stddev):   29.7670/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3236.63
    fsyncs/s:                     4144.08

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.57

General statistics:
    total time:                          30.0266s
    total number of events:              221524

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   23.18
         95th percentile:                        0.16
         sum:                                29771.50

Threads fairness:
    events (avg/stddev):           221524.0000/0.00
    execution time (avg/stddev):   29.7715/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3173.26
    fsyncs/s:                     4062.30

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               49.58

General statistics:
    total time:                          30.0274s
    total number of events:              217172

Latency (ms):
         min:                                    0.02
         avg:                                    0.14
         max:                                   22.91
         95th percentile:                        0.17
         sum:                                29776.04

Threads fairness:
    events (avg/stddev):           217172.0000/0.00
    execution time (avg/stddev):   29.7760/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3333.36
    fsyncs/s:                     4269.20

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               52.08

General statistics:
    total time:                          30.0256s
    total number of events:              228175

Latency (ms):
         min:                                    0.02
         avg:                                    0.13
         max:                                   19.78
         95th percentile:                        0.14
         sum:                                29772.22

Threads fairness:
    events (avg/stddev):           228175.0000/0.00
    execution time (avg/stddev):   29.7722/0.00